app/views/public_recipes/index.html.erb

SELECT COUNT(*) FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 8]]
SELECT SUM("foods"."price") FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 8]]
---

 <h4><%= "Total Food Items: #{recipe.foods.size}" %></h4>
<h4><%= "Total Price: #{recipe.foods.all.sum(:price)}" %></h4>