app/views/recipes/show.html.erb

      <tbody>
        <% @recipe.foods.each do  |food| %>
---
SELECT "foods".* FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 8]]

            <td><%= food.name %></td>
            <%@quantity = RecipeFood.find_by(food_id: food.id).quantity%>
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."food_id" = $1 LIMIT $2  [["food_id", 5], ["LIMIT", 1]]