app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Apple"], ["measurement_unit", "kilos"], ["price", "50.0"], ["quantity", nil], ["user_id", 1], ["created_at", "2023-06-27 10:10:39.058088"], ["updated_at", "2023-06-27 10:10:39.058088"]]
---
  def create
    @food = Food.new(food_params)
    @food.user = current_user

    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 4]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy