app/controllers/recipe_foods_controller.rb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @recipe_food = RecipeFood.find(params[:id])