app/controllers/recipe_foods_controller.rb

INSERT INTO "recipe_foods" ("quantity", "recipe_id", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 1], ["recipe_id", 1], ["food_id", 1], ["created_at", "2023-06-27 10:15:34.866920"], ["updated_at", "2023-06-27 10:15:34.866920"]]
---
  def create
    @recipe_food = RecipeFood.new(recipe_food_params)
       @recipe_food.recipe_id = params[:recipe_id]
    if @recipe_food.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["recipe_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["recipe_id", 4], ["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."food_id" = $1 LIMIT $2  [["food_id", 1], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 3]]
---
  def destroy
    @recipe = Recipe.find(params[:recipe_id])
    @food = @recipe.foods.find(params[:id])
    @recipe_food = RecipeFood.find_by(food_id: @food.id)
    @recipe_food.destroy