app/controllers/recipes_controller.rb

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "recipes" SET "public" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["public", true], ["updated_at", "2023-06-27 12:14:39.543776"], ["id", 7]]

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user = current_user
    if @recipe.save
---
INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 6]]