app/controllers/shopping_lists_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
    def index
        @current_user = current_user
        @foods = current_user.recipes.includes!(:foods).map(&:foods).flatten.uniq
        @total_price = @foods.map { |ingredient| ingredient.price * ingredient.total_quantity_recipes }.sum